# 元组

'''
元组也是常用的数据结构之一，与列表相似

元组是不可变的

元组也是有序的数列

元组也可以进行序列相加、乘法、索引、切片等操作

'''
# 元组的创建--------------------------------------------------------------------------------------------

'''元组用逗号间隔开便可创建元组'''

person1 = 5874906, 'HDR', '05/18/2018', 'Incomplete'

'''也可以用圆括号括起来'''

person1 = (5874906, 'HDR', '05/18/2018', 'Incomplete')

# 创建空元组

t = ()
print(type(t))  # <class 'tuple'>

'''
建立单一元组的元素需要在元素后面加一个逗号

如果元素后面没有逗号，则不是元组

'''
t = ('d')  # 表达式的解析
print(type(t))  # <class 'str'>

t = ('d',)  # 后者t='d',
print(type(t))  # <class 'tuple'>

'''还可以通过 tuple() 实现'''

t = tuple('abcde')  # 传递一个可迭代的对象
print(t)  # ('a', 'b', 'c', 'd', 'e')

'''与列表类似，可以结合 tuple() 和 range() 实现'''

t = tuple(range(10))
print(t)  # (0, 1, 2, 3, 4, 5, 6, 7, 8, 9)

'''
列表可以通过 tuple() 转化成员组

元组也可以通过 list() 转换成列表
'''

l = ['a', 'b', 'c', 'd']
t = tuple(l)
print(t)  # ('a', 'b', 'c', 'd')
l = list(t)
print(l)  # ['a', 'b', 'c', 'd']

'''元组有同类型元组和多类型元组'''

# 元组的访问--------------------------------------------------------------------------------------------

'''
元组同样可以通过索引、切片进行访问

还可以通过一些函数进行元素查询、成员资格等操作

'''
tuple1 = ('air', 'wind', 'cloud')
print(tuple1[0])
print(tuple1[-1])  # cloud,最后一个元素对应-1

# 元组的索引--------------------------------------------------------------------------------------------

'''
元组元素索引位置可用 tuple.index(element) 进行查看

如果有重复元素，则返回第一次出现索引的位置

'''
print(tuple1.index('air'))  # 0

# 元组切片---------------------------------------------------------------------------------------------

'''
与列表切片相同

通过 [:] 得到多个元素

通过 [::] 间隔特定数量元素获取所需元素

'''
tuple1 = ('Beijing', 'Shanghai', 'Shenzhen', 'Hangzhou', 'Chendu')
print(tuple1[0:5:2])  # ('Beijing', 'Shenzhen', 'Chendu'),间隔选取
# ('Chendu', 'Hangzhou', 'Shenzhen', 'Shanghai', 'Beijing')
print(tuple1[::-1])
print(tuple1[-5:-1])  # ('Beijing', 'Shanghai', 'Shenzhen', 'Hangzhou')
print(tuple1[-1:-5:-2])  # ('Chendu','Shenzhen')

# 元组修改---------------------------------------------------------------------------------------------

'''
元组为不可变类型序列

元组无法实现对元素进行替换或删除

元组的修改可以通过建立新元组实现

'''
taxi1 = (5870644, 'HDR', '5/1/18', 'Incomplete',
         'Not Applicable', 'Needed', 'Complete')
taxi1 = taxi1[:3]+('Complete',)+taxi1[4:]
# (5870644, 'HDR', '5/1/18', 'Complete', 'Not Applicable', 'Needed', 'Complete')
print(taxi1)

'''元组无法使用 append() insert() extend() 等函数对元素进行修改'''

'''元组的元素如果是列表，可以对列表元素进行修改'''

example2 = ('fruit', ['apple', 1, 2, 1, 0], ['orange', 2, 0, 1, 6])
example2[1].append(5)
print(example2)  # ('fruit', ['apple', 1, 2, 1, 0, 5], ['orange', 2, 0, 1, 6])

# 元组删除

'''通过 del 实现'''

tuple1 = ('air', 'wind', 'cloud')
del tuple1  # 删除元组内容与元组名

# 不可以通过clear删除元素

# 元组的操作符-------------------------------------------------------------------------------------------

'''
元组同样有链接操作符，重复操作符等

元组操作符可实现元祖与元组间的的拼接、重复、比较、成员关系等操作

元组链接操作符可实现两个元组的拼接

用 + 表示

'''

example = (1, 2, 'a', 'b', 'c')
example1 = (3, 4, 'd', 'e', 'f')
example2 = example+example1
print(example2)  # (1, 2, 'a', 'b', 'c', 3, 4, 'd', 'e', 'f')

'''元组的重复通过 * 实现'''

a = (1, 2, 3, 4)
print(a*2)  # (1, 2, 3, 4, 1, 2, 3, 4)

# 元组成员关系操作符----------------------------------------------------------------------------------------

'''
元祖成员关系操作符用于检查元素是否存在于元组中

用 in/not in 表示

返回值为布尔值 

'''
countries = ('China', 'Korea', 'Japan', 'India')
print('Japan' in countries)  # True
print('Japan' not in countries)  # False

# 元组逻辑操作-------------------------------------------------------------------------------------------

'''
元组逻辑操作符：'<' '>' '>=' '<=' '==' '!=' 'is' 'not'等

逻辑操作符可用于元组比较

< > >= <= 用于比较元组值大小

'''
# 元组元素值大小比较

t1 = (9.8, 2.3, 6, 4.5)
t2 = (9.7, 3, 7, 4)
print(t1 >= t2)  # True

t1 = ('ab', 'd', 'we', 'c')
t2 = ('aa', 's', 'd')
print(t1 > t2)  # True

'''
'==' '!=' 用于检测元组元素值是否相同

'is' 'is not' 用于检测元组引用对象是否相同

'''
code1 = (2, 0, 1, 8)
code2 = (2, 0, 1, 8)
print(code1 == code2)  # True
print(code1 is code2)  # False

code3 = ('e', 'r', 'r', 'r', 'o', 'r')
code4 = code3
print(code3 == code4)  # True
print(code3 is code4)  # True

print('a', 'g' > 'd', 3)  # a True 3
print(('a', 'g') > ('d', 3))  # False

# 元组内置函数-------------------------------------------------------------------------------------------

'''
元组也可以使用 dir(tuple) 查询所有内置函数

元组也有len()、max()、min()、sum()等序列函数

还有count()、index()等函数

'''
a = (1, 2, 3, 4, 5, 6)
print(len(a))  # 序列函数len()可用于获取元组长度（元素总个数）
print(max(a))
print(min(a))

# 用sum()可以用于计算元组中数值的总和 元素必须是数值类型

sum_ex = (5, 3, 65, 4.5, 2, 4)
print(sum(sum_ex))  # 83.5

# 用count()可获取元组中特定元素出现的次数

a = (1, 1, 5, 1, 6, 1)
print(a.count(1))  # 4

# sorted(tuple)可对元组中元素进行排序 返回重新排序后的列表

a = (5, 1, 9, 3, 7, 25, 84, 51, 34)
print(tuple(sorted(a)))  # (1, 3, 5, 7, 9, 25, 34, 51, 84)
print(tuple(sorted(a, reverse=True)))  # 降序(84, 51, 34, 25, 9, 7, 5, 3, 1)

# 嵌套元组---------------------------------------------------------------------------------------------

'''
嵌套元组可视为高维元组

嵌套元组的元组也是元组，不可改变

嵌套元组的索引和切片与嵌套列表相同

'''
