# 字典

# 字典的创建--------------------------------------------------------------------------------------------

from builtins import dict

'''
字典(dict)是python中非常常用的数据结构

字典是另一种可变容器模型，且可储存任意类型对象

字典的创建方式不唯一

常用的方式包括使用花括号 {} 和使用 dirt() 函数创建

'''
# key是字典中的键，value是字典中的值

# 键与其对应值之间用冒号:相连，不同键之间用逗号,相连

dic = {'key1': 'value1', 'key2': 'value2'}

# 第二种方法是使用 dict() 函数，键与其对应值之间用等号 = 相连，不同键之间用逗号，相连

dic = dict(key1='value1', key2='value2')

# 使用 dict() 与 zip() 函数也可以创建字典

d = dict(zip(['one', 'two', 'three'], [1, 2, 3]))
print(d)  # {'one': 1, 'two': 2, 'three': 3}

# 使用 dict() 与列表元组也可以创建字典

d = dict([('two', 2), ('one', 1), ('three', 3)])
print(d)  # {'two': 2, 'one': 1, 'three': 3}

'''
值得注意的是，字典是无序的

不能人为重新排序（可使用OrderDict有序字典进行操作）

另外，需要注意的是，字典对于值没有什么限制，但是对于键的设置却有

字典的键唯一，同一个字典不能出现相同的键

如果出现相同的键，后出现的会取代先出现的
'''
d = {1: 'a', 2: 'b', 3: 'c', 1: 'd'}
print(d)  # {1: 'd', 2: 'b', 3: 'c'}

# 字典的访问--------------------------------------------------------------------------------------------

# 查询字典中的键，使用字典自带的函数 keys

x = {'a': 1, 'b': 2}
print(x.keys())  # dict_keys(['a', 'b'])，在字典中包括 'a' 与 'b' 两个键

# 查询字典中的值，使用字典自带的函数 values

x = {'a': 1, 'b': 2}
print(x.values())  # dict_values([1, 2])，在字典x中包括1与2两个值

# 通过字典的键访问字典的值，使用中括号 [键名] 来实现

x = {'a': 1, 'b': 2}
print(x['a'])  # 1

# 另外一种方法是使用字典自带函数 get() 来实现访问值

x = {'a': 1, 'b': 2}
print(x.get('a'))  # 1
print(x.get('c'))  # None

# 字典的修改--------------------------------------------------------------------------------------------

# 如果要为字典中加入新的元素，包括键和其对应值，可以使用中括号[]

X = {'a': 1, 'b': 2}
x['c'] = 3
print(x)  # {'a': 1, 'b': 2, 'c': 3}

# 如果要一次性添加多个元素，则可以使用字典自带的函数 update() 实现

x = {'a': 1, 'b': 2, 'c': 3}
x.update({'d': 4, 'e': 5})
print(x)  # {'a': 1, 'b': 2, 'c': 3, 'd': 4, 'e': 5}

# 如果要修改字典中原有的元素，采用的方法与添加新元素相同，也是用中括号 [] 的方式

x = {'a': 1, 'b': 2, 'c': 3, 'd': 4, 'e': 5}
x['c'] = 4
print(x)  # {'a': 1, 'b': 2, 'c': 4, 'd': 4, 'e': 5}

# 如果要保留字典的值，修改字典的键，情况会比较麻烦
# 最好的办法就是删掉原有元素，再添加一个键不同的新元素

x = {'a': 1, 'b': 2, 'c': 4, 'd': 4, 'e': 5}
del x['e']
x['f'] = 5
print(x)  # {'a': 1, 'b': 2, 'c': 4, 'd': 4, 'f': 5}

# 字典的删除

# 使用 del删除字典里的元素

x = {'a': 1, 'b': 2, 'c': 4, 'd': 4, 'f': 5}
del x['f']
print(x)  # {'a': 1, 'b': 2, 'c': 4, 'd': 4}

# 同样可以使用字典自带的 pop() 函数弹出要删除的元素，可以实现同样的效果

x = {'a': 1, 'b': 2, 'c': 4, 'd': 4}
x.pop('d')
print(x)  # {'a': 1, 'b': 2, 'c': 4}

# 字典的内置函数------------------------------------------------------------------------------------------

# clear()函数会清空字典中的所有元素，但会保留字点本身

x.clear()
print(x)

# copy()函数会复制字典本身，这是一种深复制

x = {'a': 1, 'b': 2, 'c': 4}
y = x.copy()
x.pop('a')
print(x)  # {'b': 2, 'c': 4}
print(y)  # {'a': 1, 'b': 2, 'c': 4}

# fromkeys() 函数也是创建字典的一种方式

y = ('I', 'love', 'python')
y = dict.fromkeys(y, 10)
print(y)  # {'I': 10, 'love': 10, 'python': 10}

# get() 函数用于访问字典

# items() 函数用于访问字典的键和值

x = {'a': 1, 'b': 2, 'c': 4}
print(x.items())  # dict_items([('a', 1), ('b', 2), ('c', 4)])

# popitem() 函数一次弹出字典末尾的键和对应值

x = {'a': 1, 'b': 2, 'c': 4}
x.popitem()
print(x)  # {'a': 1, 'b': 2}

# setdefault() 函数和 get() 方法类似，如果键不存在于字典中，将会添加键并将值设为默认

x = {'a': 1, 'b': 2}
x.setdefault('c', 3)
print(x)  # {'a': 1, 'b': 2, 'c': 3}
